tutorials/constantVelocityFoam/phreeqcRM/calciteDissolutionWithKineticReactions/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu 		mu [1 -1 -1 0 0 0 0] 1e-3;
rho		rho [1 -3 0 0 0 0 0] 1000;


// ************************************************************************* //

geochemicalProperties
{

 rhol	rhol [1 -3 0 0 0 0 0] 1000;

 geochemicalModel phreeqcRM;
 
 mineral (Calcite);

 absolutePermeabilityModel heterogeneousScalarConstant; 
 heterogeneousScalarConstantCoeffs
 {
        K0 K0 [0 2 0 0 0 0 0] 1.e-11;
 }

 dispersionModel linearDispersion;
 linearDispersionCoeffs
 {
        Di              Di  [0 2 -1 0 0 0 0] 1e-9;
        alphaL          alphaL [0 1 0 0 0 0 0] 1e-4;
        alphaT          alphaT [0 1 0 0 0 0 0] 0;
 }


 CalciteProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 2707;
        Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
        surfaceAreaModel constantSurfaceArea;
	constantSurfaceAreaCoeffs
	{
	 A0 A0 [0 -1 0 0 0 0 0] 1;
	}
 }

 phreeqcRM
 {
        PhreeqcInputFile "phreeqcInput"; 
        PhreeqcDataBase  "phreeqc.dat";
        use_SNIA false;
        activateUpdatePorosity false;
        StrangSteps 6;
 }
}
